"json":{
   "news_articles":[
      {
         "category":"football",
         "article":"<p>I thought I had made my peace with Vin Scully's desire to broadcast the Dodgers' home games this season, fly to San Francisco for the season finale, then take off his headset and call it a career. After the national outpouring of respect and amazement for his work during the Dodgers' first homestand,...</p>",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"<p>No professional sports league in U.S. history has enjoyed a growth spurt like the one that has buoyed Major League Soccer over the last dozen years.</p> <p>MLS has doubled in size, from 10 to 20 teams, since 2004. Average attendance has grown by nearly a third, to more than 21,300 a game, higher than...</p>",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"<p>Last in a series of occasional stories on the Rams' depth by position as the team prepares for the April 28-30 NFL draft. Today, running backs:</p> <p>He is one of the best young players in the NFL, a dynamic threat capable of carrying an offense.</p> <p>Rams running back Todd Gurley rushed for 1,106 yards and...</p>",
         "class":"sports"
      },
      {
         "category":"soccer",
         "article":"<p>A handshake instead of another Stanley Cup championship.</p> <p>A season ended with a beautiful but brief tease and a first-round playoff exit.</p> <p>What had the makings of another epic rally against a familiar foe ended Friday with the Kings' 6-3 loss to the San Jose Sharks, pushing them into an off-season...</p>",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"<p>Unbeaten light-heavyweight champion Sergey Kovalev will return to Russia for a homecoming bout July 11 before his anticipated fall showdown with undefeated former super-middleweight champion Andre Ward, Kovalev's promoter, Kathy Duva, announced Saturday in Los Angeles.</p> <p>Kovalev (29-0-1, 26 knockouts)...</p>",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"<p>St. Louis' Trevor Rosenthal picked up his 100th career save last week, become the 142nd pitcher to reach that mark. How many of this 142 have been left-handed? Answer at end of these notes.... Since Aug. 24 of last season, the Mets have hit 29 home runs at Citizens Bank Park, home of the Phillies....</p>",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"<p>After feeling soreness in his right biceps on Friday night, Dodgers reliever Yimi Garcia landed on the 15-day disabled list. He did not undergo an MRI exam on his elbow, Manager Dave Roberts said.</p> <p>Garcia could undergo more extensive testing when the Dodgers return to Los Angeles after the weekend....</p>",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"<p>USC Coach Clay Helton just announced that he is not naming a starting quarterback before the fall. That means Max Browne, who was the top-ranked quarterback in the nation three years ago when he came to USC, is left hanging in the wind. The other quarterback, Sam Darnold, is a redshirt freshman....</p>",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"<p>Here are three keys from the Kings' 6-3 loss to the San Jose Sharks:</p> <p>1.) Another slow start: San Jose scored the first goal in the final four games of the series. The Sharks took the crowd out of this one, quickly, by scoring 68 seconds into it.</p> <p>2.) Regaining momentum: The Sharks’ Patrick Marleau...</p>",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"<p>The year started off so promisingly for the Kings. They were motivated, healthy and rested after a 2014-15 season in which they uncharacteristically missed the playoffs.</p> <p>All of the summer's main distractions — starting with Slava Voynov's departure to Russia — were well behind them by the start...</p>",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"<p>The drive missed Yasiel Puig's glove by inches, banging off Coors Field's newly constructed fence in right field and rolling across the warning track. Puig thumped against the wall and bounded forward with 16 steps. Colorado rookie Trevor Story rounded second base as Puig bent to clasp the baseball...</p>",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"<p>The Angels have scored 49 runs this season. The Chicago Cubs have scored 105.</p> <p>And, yes, the teams have played the same number of games.</p> <p>Albert Pujols, the Angels' cleanup batter, is hitting .138. Of the 10 men to bat for the Angels on Friday, six carry averages below .200.</p> <p><a href=\"http://www.latimes.com/sports/popular/\">See the most-read stories...</a></p>",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"<p>Christian Pulisic isn't even old enough to drive a car in Germany. But the 17-year-old American has driven soccer fans here into a frenzy since breaking into the first team at Borussia Dortmund in January.</p> <p>With his goal against Hamburg SV last weekend, he became the youngest non-German to score...</p>",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"<p>The Clippers have been here before. It hasn't gone well.</p> <p>They won the first two games of their first-round playoff series against the Memphis Grizzlies in 2013, leading some to wonder whether a sweep might result in the start of the next round being moved up a few days.</p> <p>They held a 3-1 lead in...</p>",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"<p>Huston Street wanted to make two things perfectly clear. First, the Angels closer does not believe there should be any concern over his velocity. Second, he believes social media are fueling an \"obsession\" with velocity, to the detriment of the game.</p> <p>\"I think velocity is one of the most over-hyped...</p>",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"<p>Mike Bolsinger has begun throwing bullpen sessions at the Dodgers complex at Camelback Ranch, Manager Dave Roberts said. Bolsinger, who is recovering from a strained oblique, has already completed two sessions without incident. His fastball velocity was clocked at 87 to 88 mph.</p> <p>\"He's coming,\" Roberts...</p>",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"<p>A strong breeze blew across the Westwood campus as players whipped into place. It was the last regular practice before UCLA's annual spring showcase Saturday, but linebacker Mique Juarez's head was spinning.</p> <p>\"I was in the wrong position,\" Juarez said.</p> <p>Juarez looked to veteran linebackers Jayon...</p>",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"<p>Ducks defenseman Sami Vatanen couldn't hold back his natural reaction when he discovered that he was going to be paired with Hampus Lindholm.</p> <p>Vatanen is from Finland and Lindholm from Sweden. Those countries are noted rivals in international competition and have a healthy disdain for each other.</p>...",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"<p>By their own admission, the Galaxy haven't played anything close to a complete game this season.</p> <p>They couldn't beat a 10-man team in Vancouver, settling for a draw. They needed a late own goal to tie Portland in their last game at home. And they lost in Colorado on the final shot of the game, which...</p>",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"<p>It would seem to be human nature for a boxer to feel some fear as he steps into a ring to fight another man.</p> <p>Gennady Golovkin says he doesn't experience such emotion.</p> <p>Golovkin (34-0, 31 knockouts), the unbeaten World Boxing Assn. and International Boxing Federation middleweight champion, will pursue...</p>",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"<p>The fledgling Los Angeles Football Club says it needs one more stamp of approval from the City Council and Mayor Eric Garcetti's signature before the Major League Soccer expansion team can begin building its planned $250-million soccer stadium in Exposition Park.</p> <p>But with the project now caught...</p>",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Facing Clayton Kershaw is already a ridiculously hard task for major league hitters. He's a three-time Cy Young award winner with a repertoire that includes a fastball that has averaged 93 miles per hour and been clocked as high as 98 mph, according to FanGraphs' data. Add in having to prepare...",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"<p>Ben Bishop refused to crack.</p> <p>Tampa Bay's Vezina Trophy candidate stopped 34 shots, Alex Killorn scored with less than two minutes remaining and the Lightning advanced to the second round of the Stanley Cup playoffs with a 1-0 victory over the Detroit Red Wings on Thursday night in Tampa, Fla.</p> <p>Bishop...</p>",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"<p>Behind the netminding of Frederik Andersen, the Ducks evened their best-of-seven series with the Predators with a 4-1 win at Bridgestone Arena.</p> <p>Here are three keys to the Ducks' victory Thursday night:</p> <p>1. Top notch fourth line: The Ducks’ fourth line was first-rate. Jamie McGinn, Shawn Horcoff...</p>",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"<p>The Ducks were sitting back and being too cautious as they tried to protect a one-goal lead, allowing the Nashville Predators to come at them in crashing waves of gold jerseys. Inspired by a crowd whose cheers scaled new decibel levels at Bridgestone Arena, the Predators took 12 of the first 13...</p>",
         "class":"sports"
      },
      {
         "category":"mobile",
         "article":"Uber has settled class action lawsuits with drivers in two U.S. states, offering to pay up to $100 million and agreeing to a set of new protocols.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"The price tag for help hacking into the iPhone used by one of the San Bernardino shooters was more than $1 million, according to FBI Director James Comey.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Many pieces of old technology include salvageable parts.",
         "class":"tech"
      },
      {
         "category":"tablet",
         "article":"A solar-powered airplane on an around-the-world journey has traveled 80 percent of the way from Hawaii to California",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Forecasters are finding that the human mind is more difficult to predict than a stormy atmosphere",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"The Justice Department says it has withdrawn a request to force Apple to reveal data from a cellphone linked to a New York drug case",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The Justice Department says it has withdrawn a request to force Apple to reveal data from a cellphone linked to a New York drug case",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"The Justice Department says it has withdrawn a request to force Apple to reveal data from a cellphone linked to a New York drug case",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Researchers in Nebraska are testing drones as a new tool that could eventually help in fighting grass fires",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Leaders from 175 countries signed the Paris Agreement on climate change Friday as the landmark deal took a key step toward entering into force years ahead of schedule",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The pilot of a solar-powered plane on an around-the-world journey took a few minutes on Friday _ Earth Day _ to exchange pleasantries with the United Nations secretary-general while he flew high above the Pacific Ocean en route to a stop in California",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"A lawyer for the former staffer who set up Hillary Clinton's private email server says his client still won't appear before Congress",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Facebook's new artificially intelligent feature can now describe photos in stunning detail to visually impaired users using a screen reader.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"The bar can, \"discretely move them away.\"",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"In the wake of Apple vs. FBI, WhatsApp completes encryption rollout.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"FBI Director James Comey hinted at the price tag by comparing it to his salary.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Snapchat has paid tribute to the late music legend by adding a filter that superimposes purple rain droplets over photos taken with the app.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"ABC News' Rachel Scott introduces us to a group of innovators at Tech Day.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"New feature allows users to make conference calls with up to 50 people.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Tech-giant Apple have updated the MacBook making it thinner and lighter than ever.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Amy Hess, executive assistant director for science and technology at the FBI, testified before a House Energy and Commerce subcommittee today.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Online video-giant YouTube now offers the ability to live stream 360-degree virtual reality videos.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The planet is believed to be five to ten times the mass of Jupiter.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Sometimes that “Toaster” filter is just too much, right?",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Can the Mormon Church trademark the term \"Mormon?\" A legal dispute with a small business asks that question.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"In today’s Worldwide Developer Conference, Apple rolled out a few new features for its iMessage app, including audio and video messages, and group messaging capabilities. Not all tech junkies were happy about Apple’s innovation.  Co-founder of WhatsApp, Jan Koum, tweeted out this message after Apple’s...",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Before there was Facebook, or YouTube, or Twitter, there was HOTorNOT, the website where (in the words of co-founder James Hong), “People uploaded their picture for others to rate on a scale of 1 to 10 based on hotness.” Hong and his partner, Jim Young, once told Newsweek that their inspired idea was born when the two U.C. Berkeley electrical engineers disagreed over the attractiveness of a passing woman. The site they launched in 2000 originally was called “Am I Hot Or Not.” But like “The Facebook,” its name quickly got pared down to its essence.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Remember those terrible photos you posted on Myspace ten years ago? Well, Myspace does – and they might send you some to refresh your memory.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Rising costs of airfare may price out travelers in the future.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"PS4 Xbox",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Windows 8.1: Microsoft's Big Update Explained in Photos",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Microsoft plans to buy Nokia's phone and devices business. Here we look back at some of the best Nokia phones.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"3D Print Everything: Printing Birdhouses to Violins to Shoes",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Google pays homage to the author's classics in a doodle slideshow.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Motorola's Moto X smartphone is made in the U.S.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"It happens only once this year as the moon on its elliptical orbit is at its closest point to earth",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"At Google's big developer's conference, the company announced a new music and chat service and updates to Google Maps.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Seahorse Armor Inspire Robotic Designs",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The Mars rovers, Opportunity and Spirit, landed on the red planet in 2004 and were expected by NASA to last for 90 days.  As of July 2012, Opportunity was still going after 3,000.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Apple? Samsung? Who needs them, when you can build your own cellphone.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Facebook Home and HTC First in Photos",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Curiosity found shiny objects embedded in Maritan soil leading them to believe these objects are native to the planet.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"From Tamaotchi to Furby to BopIt. ABC News has rounded up some of the best tech toys of the 1990s.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Enthusiasts check out the latest in emerging technology.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Spacecraft telescopes offer rare looks at the solar system and beyond.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"History of the BlackBerry",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Absolutely adorable baby animals!",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"A behind-the-scenes look at the Microsoft Surface, new tablet computer with a $499 starting price.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"A behind the scenes look at the vast data centers at Google, where users' searches, YouTube video requests and Gmails are routed.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Court documents reveal photos of early iPhone prototypes",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Want to know how long to keep your tax paperwork, how to make websites with small text easier to see, and more? Read this column.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Researchers in Nebraska tested a new tool on Friday that could eventually help in fighting grass fires — drones.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The Justice Department said Friday it has withdrawn a request that sought a court order forcing Apple to assist in opening a locked iPhone 5s linked to a drug case in New York.",
         "class":"tech"
      },
      {
         "category":"tablet",
         "article":"A NASA fellow and aerospace engineering student at the University of Colorado has invented a robot and artificial intelligence system that's may open new avenues for space exploration and habitation.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Elon Musk may have some pretty astronomical ideas when it comes to space travel ( a city on Mars?",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"IDC says video games will \"clearly be the lead rationale\" for folks to pick up a VR headset this year.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Facebook will take into consideration time spent on something in addition to likes or comments.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Apple Inc. said Friday it hopes to resume its online iTunes and iBooks services in China, where they were recently shut down less than seven months after being launched.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Swiss Alps, Swiss banks … Swiss privacy?",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"There was understandable alarm in the U.K. earlier in the week when a drone reportedly hit a passenger plane coming in to land at London's Heathrow airport.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Uber has settled class action lawsuits with drivers in two U.S. states, offering to pay up to $100 million and agreeing to a set of new protocols.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"The price tag for help hacking into the iPhone used by one of the San Bernardino shooters was more than $1 million, according to FBI Director James Comey.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Many pieces of old technology include salvageable parts.",
         "class":"tech"
      },
      {
         "category":"tablet",
         "article":"A solar-powered airplane on an around-the-world journey has traveled 80 percent of the way from Hawaii to California",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Forecasters are finding that the human mind is more difficult to predict than a stormy atmosphere",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"The Justice Department says it has withdrawn a request to force Apple to reveal data from a cellphone linked to a New York drug case",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The Justice Department says it has withdrawn a request to force Apple to reveal data from a cellphone linked to a New York drug case",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"The Justice Department says it has withdrawn a request to force Apple to reveal data from a cellphone linked to a New York drug case",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Researchers in Nebraska are testing drones as a new tool that could eventually help in fighting grass fires",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Leaders from 175 countries signed the Paris Agreement on climate change Friday as the landmark deal took a key step toward entering into force years ahead of schedule",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The pilot of a solar-powered plane on an around-the-world journey took a few minutes on Friday _ Earth Day _ to exchange pleasantries with the United Nations secretary-general while he flew high above the Pacific Ocean en route to a stop in California",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"A lawyer for the former staffer who set up Hillary Clinton's private email server says his client still won't appear before Congress",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Facebook's new artificially intelligent feature can now describe photos in stunning detail to visually impaired users using a screen reader.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"The bar can, \"discretely move them away.\"",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"In the wake of Apple vs. FBI, WhatsApp completes encryption rollout.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"FBI Director James Comey hinted at the price tag by comparing it to his salary.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Snapchat has paid tribute to the late music legend by adding a filter that superimposes purple rain droplets over photos taken with the app.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"ABC News' Rachel Scott introduces us to a group of innovators at Tech Day.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"New feature allows users to make conference calls with up to 50 people.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Tech-giant Apple have updated the MacBook making it thinner and lighter than ever.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Amy Hess, executive assistant director for science and technology at the FBI, testified before a House Energy and Commerce subcommittee today.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Online video-giant YouTube now offers the ability to live stream 360-degree virtual reality videos.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The planet is believed to be five to ten times the mass of Jupiter.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Sometimes that “Toaster” filter is just too much, right?",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Can the Mormon Church trademark the term \"Mormon?\" A legal dispute with a small business asks that question.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"In today’s Worldwide Developer Conference, Apple rolled out a few new features for its iMessage app, including audio and video messages, and group messaging capabilities. Not all tech junkies were happy about Apple’s innovation.  Co-founder of WhatsApp, Jan Koum, tweeted out this message after Apple’s...",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Before there was Facebook, or YouTube, or Twitter, there was HOTorNOT, the website where (in the words of co-founder James Hong), “People uploaded their picture for others to rate on a scale of 1 to 10 based on hotness.” Hong and his partner, Jim Young, once told Newsweek that their inspired idea was born when the two U.C. Berkeley electrical engineers disagreed over the attractiveness of a passing woman. The site they launched in 2000 originally was called “Am I Hot Or Not.” But like “The Facebook,” its name quickly got pared down to its essence.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Remember those terrible photos you posted on Myspace ten years ago? Well, Myspace does – and they might send you some to refresh your memory.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Rising costs of airfare may price out travelers in the future.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"PS4 Xbox",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Windows 8.1: Microsoft's Big Update Explained in Photos",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Microsoft plans to buy Nokia's phone and devices business. Here we look back at some of the best Nokia phones.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"3D Print Everything: Printing Birdhouses to Violins to Shoes",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Google pays homage to the author's classics in a doodle slideshow.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Motorola's Moto X smartphone is made in the U.S.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"It happens only once this year as the moon on its elliptical orbit is at its closest point to earth",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"At Google's big developer's conference, the company announced a new music and chat service and updates to Google Maps.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Seahorse Armor Inspire Robotic Designs",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"The Mars rovers, Opportunity and Spirit, landed on the red planet in 2004 and were expected by NASA to last for 90 days.  As of July 2012, Opportunity was still going after 3,000.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Apple? Samsung? Who needs them, when you can build your own cellphone.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Facebook Home and HTC First in Photos",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Curiosity found shiny objects embedded in Maritan soil leading them to believe these objects are native to the planet.",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"From Tamaotchi to Furby to BopIt. ABC News has rounded up some of the best tech toys of the 1990s.",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"Enthusiasts check out the latest in emerging technology.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"Spacecraft telescopes offer rare looks at the solar system and beyond.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"History of the BlackBerry",
         "class":"tech"
      },
      {
         "category":"cisco",
         "article":"Absolutely adorable baby animals!",
         "class":"tech"
      },
      {
         "category":"computer",
         "article":"A behind-the-scenes look at the Microsoft Surface, new tablet computer with a $499 starting price.",
         "class":"tech"
      },
      {
         "category":"mobile",
         "article":"A behind the scenes look at the vast data centers at Google, where users' searches, YouTube video requests and Gmails are routed.",
         "class":"tech"
      },
      {
         "category":"ibm",
         "article":"Court documents reveal photos of early iPhone prototypes",
         "class":"tech"
      },
      {
         "category":"football",
         "article":"There were some who would rather Van Gaal had remained among the ranks of the damned, hastened to his doom as swiftly as possible so that Jose Mourinho can ride in on his white charger.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Everton have opened talks over a new long-term contract for Ross Barkley that would make him one of the club’s highest earners.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Tennis players competing at Wimbledon have seen their earnings increase at more than twice the rate of Premier League footballers in the last six years.",
         "class":"sports"
      },
      {
         "category":"soccer",
         "article":"Alloa did their best to dampen the party mood before Rangers were presented with the Ladbrokes Championship trophy as they held on for a 1-1 draw at Ibrox.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"RIATH AL-SAMARRAI AT DEAN COURT: Eden Hazard did what he used to do so often and Cesc Fabregas was exquisite, a master craftsman of vision and touch.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"JOE BERNSTEIN AT ANFIELD: Not quite the Miracle of Istanbul, but Newcastle will remember this second-half comeback for many years to come should it save them from relegation.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Aston Villa winger Adama Traore is facing a club fine after posting a rant against the club on his Facebook account. The 20-year-old former Barcelona winger was left out of Saturday's defeat to Southampton.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Vincent Kompany is ready to lead Manchester City into Tuesday's Champions League semi-final against Real Madrid, but Yaya Toure could be a doubt for the Etihad clash.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"ROB DRAPER AT WEMBLEY: It was a pure Manchester United moment, the sort we had come to forget. It was bold, brash and, like their best victories, it came at the death.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"SAM CUNNINGHAM AT VILLA PARK: The nation celebrated 400 years since William Shakespeare’s death, but even he would have struggled to write this Aston Villa tragedy.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"GLENN HODDLE: Real Madrid have had a topsy-turvy season but now they stand on the cusp of a Champions League final and are still in with a chance of winning La Liga.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Sebastian Coe will join one of his two sons in running the London Marathon on Sunday. Coe Jnr will do it all. His father will run just sections of the course. It is part exercise, part paternal support.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"RIK SHARMA AT THE NOU CAMP: Luis Suarez struck four times as Barcelona routed Sporting Gijon to go back top of La Liga after Atletico and Real won earlier to send the Catalans to fourth.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"The centre back could be hit with a two-year ban after testing positive for a banned substance following their Europa League tie against Manchester United.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Already shorn of Jordan Henderson, Emre Can and Divock Origi for the Europa League semi-final against Villarreal and probably the season, he must now face up to life without Kop cult hero Sakho for six months.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"With Richard Cockerill casting Leicester as the Band of Merry Men against the ‘rock stars and big budgets’ of Racing 92, Dan Carter is the obvious choice to play the Sheriff of Nottingham.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"When Freddie Burns trudged from the field in despair at Kingsholm two years ago, it was hard to believe the fly-half had a future in rugby, let alone an international one.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Watford's last FA Cup semi-final hero George Reilly has turned down an invitation to see his former club at Wembley today, deciding instead to watch from the comfort of his local in Corby.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"The official countdown to Rio 2016 began last week with the lighting of the Olympic flame in Greece. But is Rio ready to deliver when there is so much that could potentially hold things back?",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Hugo Lloris says he trusted Mauricio Pochettino from the moment he met him – and that faith has been repaid with Tottenham's best season for over half-a-century.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"EXCLUSIVE BY JOE BERNSTEIN AND PETE JENSON: Manuel Pellegrini’s semi-final clash with his former club, Real Madrid, is so much more than a reunion with Cristiano Ronaldo.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"LAURIE WHITWELL: Claudio Ranieri has told Wes Morgan and Robert Huth to carry on grappling despite increased focus on Leicester's defensive techniques at set pieces.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"EXCLUSIVE: Jonny Bairstow bristles as he talks passionately about the quest to prove that his wicketkeeping really is good enough to see him judged as a genuine Test all-rounder.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"This winners of this year’s London Marathon will have to wait five years to receive their full prize money, up to £105,000, after a new payment plan was introduced to deter drugs cheats.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"ROB DRAPER SPECIAL REPORT: Every year they would go to the football club at Sarcelles in north-east Paris and take the players away. Every year the same. But not Riyad Mahrez.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"UK Sport have welcomed an investigation into allegations that Shane Sutton told her to 'move on and get on with having a baby' after being dropped from the Olympic performance team.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Five-time world champion Ronnie O'Sullivan says snooker must leave its spiritual home at the Crucible — and Ali Carter for one will be delighted to see the back of it.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"GERRY COX AT WEMBLEY: Sportsmail rates both sides as Louis van Gaal's side reached their first FA Cup final since 2007 at the hands of Roberto Martinez's men...",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"OLIVER HOLT: Neil Warnock is the Jose Mourinho of the lower leagues. He is a showman and he is the best. He is the greatest lower league manager this country has ever had.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Joe Marler will find out on Monday if he will be cited for an incident in Harlequins’ European Challenge Cup semi-final win over Grenoble on Friday when he appeared to kick an opponent.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Video footage has emerged of a fight between Manchester United and Everton fans at a service station ahead of Saturday's FA Cup semi-final between the two clubs.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"ROB DRAPER: Louis van Gaal was defiant as Manchester United celebrated making the FA Cup final for the first time in nine years following Anthony Martial's injury-time winner.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"Stuart Dallas struck with two minutes left to earn Leeds a 2-2 draw in their Yorkshire derby with Hull at the KC Stadium. Abel Hernandez and Tom Huddlestone had put Hull 2-1 up.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"PETE JENSON: Gareth Bale scored the first and the third goal as Real Madrid came back from 2-0 down to beat Rayo Vallecano at a rain-soaked Vallecas.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Bath held off a Sale fightback to get their revenge for last week's defeat with a 32-26 win at the Recreation Ground in the Aviva Premiership.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Angel Correa scored the only goal of the game as Atletico Madrid boosted their La Liga title hopes with three points at home against Malaga.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"Peterborough manager Graham Westley has left the club following Saturday's home defeat by Scunthorpe. Westley managed Peterborough for 41 games, winning 18, drawing 6 and losing 17.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"MARCUS TOWNEND: Paul Nicholls claimed his 10th trainers’ championship was the sweetest of all after sealing a dramatic last-day victory at Sandown from big rival Willie Mullins.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Real Madrid coach Zinedine Zidane hailed Gareth Bale’s impact on his team and said Cristiano Ronaldo would travel to Manchester for the Champions League semi-final first leg.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Manchester United reached the FA Cup final at the expense of Everton, thanks to a late Anthony Martial goal. Here are five things Sportsmail's Dominic King learned at Wembley...",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"One by one, they fell to their knees. Some were on the brink of tears, others clamped their hands on their heads as the emptiness and heartbreak began to consume them.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Sir AP McCoy said the greatest compliment he could pay Richard Johnson was that much of what he achieved during his record-breaking career was down to being pushed so hard by his great rival.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"SAM PETERS: Saracens' dream of securing European glory after years of near misses moved a step closer as their pack bullied Wasps in an enthralling but ultimately one-sided Champions Cup semi-final.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"KIERAN GILL AT ANFIELD: The Kop sang his name. A banner unfurled read: 'Rafa's Revolution – Istanbul 2005.' His best moments even adorned Anfield's press room wall.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"Brighton maintained their push for the Barclays Premier League after a hard-fought win at relegated Charlton. Sam Baldock opened the scoring for the visitors early on.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"MK Dons' relegation back to League One was confirmed on Saturday following their defeat by mid-table Brentford. Karl Robinson's side went into the game knowing three points were a must.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Having ceded top spot of the Championship to Burnley on Friday night, Aitor Karanka's Middlesbrough side were unable to reclaim it as they failed to break down the stubborn visitors.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Bayern Munich beat Hertha Berlin 2-0 on Saturday but had to put the Bundesliga champagne on ice after Borussia Dortmund downed VfB Stuttgart 3-0. Bayern can win the title next week",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"CHRIS WHEELER AT THE ETIHAD STADIUM: As a prelude to Tuesday’s Champions League semi-final here against Real Madrid, Manuel Pellegrini could hardly have wished for anything better.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Benzema was substituted after 42 minutes of the game at Estadio de Vallecas, with Lucas Vazquez coming on in his place. Real are already sweating over the fitness of Cristiano Ronaldo.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Darren Bent rescued a point for Derby County in their play-off clash with Sheffield Wednesday. Bent came off the bench to head home in the final 10 minutes to ensure the game ended level at 1-1.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Anthony Joshua is the man to breathe new life into the ‘dying’ heavyweight division by unifying all four championship belts, according to boxing icon Oscar De La Hoya.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"Arsenal should make every effort to sign Leicester City's N'Golo Kante this summer, says Thierry Henry. Henry believes Kante could be the man to help Arsene Wenger's claim silverware.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Shinkwin began the delayed round at Genzon Golf Club 11 shots off the lead, but set the clubhouse target on 12 under par before play was suspended due to darkness.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Chelsea scout Piet de Visser has admitted he was angry when Jose Mourinho allowed Kevin de Bruyne to leave the club. The Belgian had only played nine times for the Blues when he was sold.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"JAMIE CARRAGHER: In July 2013, when Arsenal were pursuing Luis Suarez, how different would things have been had they made Liverpool a proper offer?",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"The 30-year-old suffered what the club have called a 'serious knee injury' in Friday's training session and was not in the squad for the Potters' clash with Manchester City at the Etihad Stadium.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"After the Professional Footballers' Association Premier League Team of the Year was announced this week, Sportsmail looks back on all the selections from each Premier League season.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Conor McGregor's seat was vacant, and so now is his spot headlining the big UFC 200 card this summer. The Irish fighter was a no-show at a press conference Friday promoting the card.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Striker Solanke, 18, has one year left on the contract he signed in 2014 and has so far rejected a new one. Chelsea have reacted by preparing a move for Fulham forward Moussa Dembele.",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"Brendan Rodgers is closing in on a return to management at his former club Swansea. Rodgers left South Wales for three years at Liverpool but was fired in October and replaced by Jurgen Klopp.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"MATT BARLOW EXCLUSIVE: As someone who once trained as a glazier you would expect Alan Pardew to recognise a glass ceiling when he sees one — but he is ready to admit.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"England and Manchester United captain Wayne Rooney has amassed an £82million fortune which makes him the richest sportsman aged 30 or under, a rise of £10m from last year.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Gennady Golovkin takes on Dominic Wade on Saturday night yet all the focus is directed firmly into the future. The Kazakhstan knock-out specialist weighed in at 159lbs, to the American's 159.6lbs",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"Jerzy Dudek was so angry with how he was treated by Rafa Benitez after winning the Champions League in 2005 with Liverpool that he 'genuinely considered' punching him in the face.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"CHARLES SALE: Strict new FA requirements for the re-named regional talent clubs mean 35 top county FAs and professional clubs, including Watford, have not applied for licences.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Serbia’s desire to make Andy Murray think twice about playing twice in the Davis Cup quarter final already appears to have had the desired effect.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"Carl Frampton has announced he will face Leo Santa Cruz this summer in New York. News of the fight broke earlier this evening when Frampton's manager Barry McGuigan told social",
         "class":"sports"
      },
      {
         "category":"football",
         "article":"No-one could possibly describe Joe Root’s sublime sustained form in the England middle order as broken so he is very reluctant to try and fix it.",
         "class":"sports"
      },
      {
         "category":"cricket",
         "article":"Vardy has netted 22 goals this season to guide the Foxes to within touching distance of the title but faces missing two vital games in the run-in after his sending off against West Ham last week.",
         "class":"sports"
      },
      {
         "category":"rugby",
         "article":"Mauricio Pochettino will scoop an extra £500,000 in bonuses if he guides his Tottenham side to the Premier League title this season. The Argentine signed the clause when he arrived in summer 2014.",
         "class":"sports"
      },
      {
         "category":"tennis",
         "article":"MATT BARLOW: Mesut Ozil, ever the enigma. Arguably the most gifted footballer on these shores and yet his finest season in English football is not good enough for a place in the PFA Team of the Year.",
         "class":"sports"
      }
   ]
}
}